test_postgresql/20000user_10threads.log
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 10
Report intermediate results every 1 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 1s ] thds: 10 tps: 1340.17 qps: 26934.96 (r/w/o: 18872.02/5360.67/2702.27) lat (ms,95%): 13.46 err/s: 1.99 reconn/s: 0.00
[ 2s ] thds: 10 tps: 2045.21 qps: 41036.36 (r/w/o: 28729.06/8193.86/4113.44) lat (ms,95%): 7.30 err/s: 8.00 reconn/s: 0.00
[ 3s ] thds: 10 tps: 2148.02 qps: 43026.39 (r/w/o: 30138.28/8577.08/4311.04) lat (ms,95%): 7.04 err/s: 2.00 reconn/s: 0.00
[ 4s ] thds: 10 tps: 2027.99 qps: 40678.71 (r/w/o: 28478.79/8120.94/4078.97) lat (ms,95%): 7.43 err/s: 6.00 reconn/s: 0.00
[ 5s ] thds: 10 tps: 2116.98 qps: 42424.65 (r/w/o: 29695.75/8474.93/4253.96) lat (ms,95%): 7.04 err/s: 6.00 reconn/s: 0.00
[ 6s ] thds: 10 tps: 1856.04 qps: 37224.78 (r/w/o: 26072.54/7419.16/3733.08) lat (ms,95%): 8.28 err/s: 5.00 reconn/s: 0.00
[ 7s ] thds: 10 tps: 2036.05 qps: 40844.83 (r/w/o: 28593.58/8143.22/4108.04) lat (ms,95%): 7.30 err/s: 9.98 reconn/s: 0.00
[ 8s ] thds: 10 tps: 1903.69 qps: 38214.10 (r/w/o: 26766.90/7619.77/3827.42) lat (ms,95%): 8.28 err/s: 6.01 reconn/s: 0.00
[ 9s ] thds: 10 tps: 2012.96 qps: 40323.16 (r/w/o: 28231.41/8051.83/4039.92) lat (ms,95%): 7.30 err/s: 2.00 reconn/s: 0.00
[ 10s ] thds: 10 tps: 1912.02 qps: 38312.39 (r/w/o: 26825.28/7651.08/3836.04) lat (ms,95%): 7.84 err/s: 4.00 reconn/s: 0.00
[ 11s ] thds: 10 tps: 1953.00 qps: 39123.03 (r/w/o: 27392.02/7810.01/3921.00) lat (ms,95%): 8.43 err/s: 4.00 reconn/s: 0.00
[ 12s ] thds: 10 tps: 1894.93 qps: 38012.69 (r/w/o: 26617.08/7585.74/3809.87) lat (ms,95%): 8.90 err/s: 5.00 reconn/s: 0.00
[ 13s ] thds: 10 tps: 1948.22 qps: 39048.37 (r/w/o: 27338.06/7796.88/3913.43) lat (ms,95%): 7.70 err/s: 5.00 reconn/s: 0.00
[ 14s ] thds: 10 tps: 2045.88 qps: 41007.70 (r/w/o: 28710.39/8186.53/4110.77) lat (ms,95%): 6.91 err/s: 5.00 reconn/s: 0.00
[ 15s ] thds: 10 tps: 1944.58 qps: 38932.56 (r/w/o: 27261.09/7771.32/3900.15) lat (ms,95%): 6.91 err/s: 2.00 reconn/s: 0.00
[ 16s ] thds: 10 tps: 1898.40 qps: 38041.00 (r/w/o: 26628.60/7595.60/3816.80) lat (ms,95%): 7.98 err/s: 5.00 reconn/s: 0.00
[ 17s ] thds: 10 tps: 1976.67 qps: 39575.48 (r/w/o: 27714.44/7893.70/3967.35) lat (ms,95%): 7.17 err/s: 3.00 reconn/s: 0.00
[ 18s ] thds: 10 tps: 1970.31 qps: 39495.22 (r/w/o: 27641.36/7891.24/3962.62) lat (ms,95%): 7.04 err/s: 5.00 reconn/s: 0.00
[ 19s ] thds: 10 tps: 1839.69 qps: 36847.87 (r/w/o: 25799.71/7354.78/3693.39) lat (ms,95%): 7.56 err/s: 3.00 reconn/s: 0.00
[ 20s ] thds: 10 tps: 1806.95 qps: 36240.07 (r/w/o: 25385.35/7224.82/3629.91) lat (ms,95%): 9.06 err/s: 5.00 reconn/s: 0.00
[ 21s ] thds: 10 tps: 2049.68 qps: 41064.57 (r/w/o: 28750.50/8203.72/4110.36) lat (ms,95%): 7.17 err/s: 3.00 reconn/s: 0.00
[ 22s ] thds: 10 tps: 2057.66 qps: 41185.20 (r/w/o: 28821.24/8238.64/4125.32) lat (ms,95%): 7.30 err/s: 1.00 reconn/s: 0.00
[ 23s ] thds: 10 tps: 1990.08 qps: 39850.62 (r/w/o: 27908.14/7949.32/3993.16) lat (ms,95%): 7.43 err/s: 3.00 reconn/s: 0.00
[ 24s ] thds: 10 tps: 1876.99 qps: 37612.77 (r/w/o: 26327.84/7508.95/3775.98) lat (ms,95%): 7.98 err/s: 9.00 reconn/s: 0.00
[ 25s ] thds: 10 tps: 2018.00 qps: 40456.95 (r/w/o: 28335.97/8064.99/4056.00) lat (ms,95%): 7.30 err/s: 1.00 reconn/s: 0.00
[ 26s ] thds: 10 tps: 2022.02 qps: 40489.34 (r/w/o: 28347.24/8081.07/4061.03) lat (ms,95%): 7.43 err/s: 3.00 reconn/s: 0.00
[ 27s ] thds: 10 tps: 1835.97 qps: 36740.49 (r/w/o: 25713.64/7345.90/3680.95) lat (ms,95%): 8.74 err/s: 2.00 reconn/s: 0.00
[ 28s ] thds: 10 tps: 1970.01 qps: 39588.28 (r/w/o: 27732.20/7889.06/3967.03) lat (ms,95%): 7.56 err/s: 8.00 reconn/s: 0.00
[ 29s ] thds: 10 tps: 1950.02 qps: 39037.40 (r/w/o: 27321.28/7798.08/3918.04) lat (ms,95%): 7.56 err/s: 5.00 reconn/s: 0.00
[ 30s ] thds: 10 tps: 1777.00 qps: 35685.06 (r/w/o: 24992.04/7115.01/3578.01) lat (ms,95%): 10.27 err/s: 8.00 reconn/s: 0.00
[ 31s ] thds: 10 tps: 1924.81 qps: 38541.24 (r/w/o: 26983.36/7697.25/3860.62) lat (ms,95%): 7.70 err/s: 3.00 reconn/s: 0.00
[ 32s ] thds: 10 tps: 2051.11 qps: 41111.27 (r/w/o: 28785.59/8209.45/4116.23) lat (ms,95%): 7.17 err/s: 5.00 reconn/s: 0.00
[ 33s ] thds: 10 tps: 1976.05 qps: 39627.03 (r/w/o: 27744.72/7915.21/3967.10) lat (ms,95%): 7.43 err/s: 4.00 reconn/s: 0.00
[ 34s ] thds: 10 tps: 1830.02 qps: 36662.38 (r/w/o: 25673.27/7313.08/3676.04) lat (ms,95%): 7.70 err/s: 4.00 reconn/s: 0.00
[ 35s ] thds: 10 tps: 2051.00 qps: 41076.04 (r/w/o: 28760.03/8192.01/4124.00) lat (ms,95%): 7.30 err/s: 4.00 reconn/s: 0.00
[ 36s ] thds: 10 tps: 2060.01 qps: 41260.30 (r/w/o: 28885.21/8242.06/4133.03) lat (ms,95%): 7.30 err/s: 3.00 reconn/s: 0.00
[ 37s ] thds: 10 tps: 1592.99 qps: 31934.71 (r/w/o: 22362.80/6373.94/3197.97) lat (ms,95%): 7.84 err/s: 4.00 reconn/s: 0.00
[ 38s ] thds: 10 tps: 1904.86 qps: 38173.23 (r/w/o: 26727.06/7625.45/3820.72) lat (ms,95%): 8.58 err/s: 4.00 reconn/s: 0.00
[ 39s ] thds: 10 tps: 1934.14 qps: 38735.74 (r/w/o: 27106.92/7751.55/3877.27) lat (ms,95%): 7.98 err/s: 3.00 reconn/s: 0.00
[ 40s ] thds: 10 tps: 2028.01 qps: 40725.16 (r/w/o: 28514.12/8138.03/4073.02) lat (ms,95%): 7.30 err/s: 5.00 reconn/s: 0.00
[ 41s ] thds: 10 tps: 1864.00 qps: 37277.10 (r/w/o: 26104.07/7434.02/3739.01) lat (ms,95%): 8.43 err/s: 3.00 reconn/s: 0.00
[ 42s ] thds: 10 tps: 1868.99 qps: 37508.72 (r/w/o: 26268.81/7478.94/3760.97) lat (ms,95%): 8.43 err/s: 6.00 reconn/s: 0.00
[ 43s ] thds: 10 tps: 1670.21 qps: 33387.24 (r/w/o: 23365.97/6675.85/3345.42) lat (ms,95%): 9.73 err/s: 1.00 reconn/s: 0.00
[ 44s ] thds: 10 tps: 1937.93 qps: 38864.57 (r/w/o: 27214.01/7758.71/3891.86) lat (ms,95%): 7.56 err/s: 3.00 reconn/s: 0.00
[ 45s ] thds: 10 tps: 1967.99 qps: 39370.75 (r/w/o: 27564.82/7859.95/3945.97) lat (ms,95%): 7.56 err/s: 2.00 reconn/s: 0.00
[ 46s ] thds: 10 tps: 2037.76 qps: 40786.27 (r/w/o: 28555.69/8144.05/4086.53) lat (ms,95%): 7.30 err/s: 3.00 reconn/s: 0.00
[ 47s ] thds: 10 tps: 2067.25 qps: 41376.95 (r/w/o: 28958.46/8273.99/4144.50) lat (ms,95%): 7.30 err/s: 3.00 reconn/s: 0.00
[ 48s ] thds: 10 tps: 2033.94 qps: 40832.79 (r/w/o: 28603.15/8137.76/4091.88) lat (ms,95%): 7.30 err/s: 7.00 reconn/s: 0.00
[ 49s ] thds: 10 tps: 2050.04 qps: 41166.78 (r/w/o: 28828.55/8203.16/4135.08) lat (ms,95%): 7.30 err/s: 10.00 reconn/s: 0.00
[ 50s ] thds: 10 tps: 2038.98 qps: 40816.62 (r/w/o: 28569.73/8160.92/4085.96) lat (ms,95%): 7.30 err/s: 1.00 reconn/s: 0.00
[ 51s ] thds: 10 tps: 2013.22 qps: 40304.26 (r/w/o: 28224.96/8036.90/4042.40) lat (ms,95%): 7.30 err/s: 2.99 reconn/s: 0.00
[ 52s ] thds: 10 tps: 1749.60 qps: 35049.02 (r/w/o: 24529.41/7005.40/3514.22) lat (ms,95%): 10.46 err/s: 5.01 reconn/s: 0.00
[ 53s ] thds: 10 tps: 1829.74 qps: 36681.86 (r/w/o: 25695.41/7315.96/3670.49) lat (ms,95%): 8.43 err/s: 3.00 reconn/s: 0.00
[ 54s ] thds: 10 tps: 1871.04 qps: 37460.76 (r/w/o: 26218.53/7490.15/3752.08) lat (ms,95%): 8.13 err/s: 3.00 reconn/s: 0.00
[ 55s ] thds: 10 tps: 1790.82 qps: 35896.46 (r/w/o: 25138.52/7163.29/3594.65) lat (ms,95%): 7.43 err/s: 2.00 reconn/s: 0.00
[ 56s ] thds: 10 tps: 271.49 qps: 5421.90 (r/w/o: 3791.94/1082.98/546.98) lat (ms,95%): 14.21 err/s: 1.00 reconn/s: 0.00
[ 57s ] thds: 10 tps: 1351.62 qps: 27083.46 (r/w/o: 18957.72/5412.48/2713.26) lat (ms,95%): 12.52 err/s: 2.00 reconn/s: 0.00
[ 58s ] thds: 10 tps: 1882.01 qps: 37646.22 (r/w/o: 26357.15/7520.04/3769.02) lat (ms,95%): 8.58 err/s: 1.00 reconn/s: 0.00
[ 59s ] thds: 10 tps: 1836.96 qps: 36841.21 (r/w/o: 25794.45/7354.84/3691.92) lat (ms,95%): 8.43 err/s: 4.00 reconn/s: 0.00
[ 60s ] thds: 10 tps: 1936.05 qps: 38741.92 (r/w/o: 27119.65/7733.18/3889.09) lat (ms,95%): 7.70 err/s: 3.00 reconn/s: 0.00
[ 61s ] thds: 10 tps: 1671.00 qps: 33549.10 (r/w/o: 23497.07/6691.02/3361.01) lat (ms,95%): 9.06 err/s: 7.00 reconn/s: 0.00
[ 62s ] thds: 10 tps: 1858.93 qps: 37233.52 (r/w/o: 26068.97/7428.71/3735.85) lat (ms,95%): 8.43 err/s: 4.00 reconn/s: 0.00
[ 63s ] thds: 10 tps: 1585.25 qps: 31742.06 (r/w/o: 22222.54/6343.02/3176.51) lat (ms,95%): 11.65 err/s: 0.00 reconn/s: 0.00
[ 64s ] thds: 10 tps: 1846.92 qps: 36917.48 (r/w/o: 25834.94/7378.69/3703.85) lat (ms,95%): 8.74 err/s: 3.00 reconn/s: 0.00
[ 65s ] thds: 10 tps: 1932.01 qps: 38755.26 (r/w/o: 27138.18/7737.05/3880.03) lat (ms,95%): 7.70 err/s: 3.00 reconn/s: 0.00
[ 66s ] thds: 10 tps: 1829.97 qps: 36667.36 (r/w/o: 25671.55/7317.87/3677.94) lat (ms,95%): 8.43 err/s: 5.00 reconn/s: 0.00
[ 67s ] thds: 10 tps: 1909.45 qps: 38296.87 (r/w/o: 26822.21/7631.78/3842.88) lat (ms,95%): 7.70 err/s: 5.00 reconn/s: 0.00
[ 68s ] thds: 10 tps: 1976.59 qps: 39649.74 (r/w/o: 27760.22/7913.34/3976.18) lat (ms,95%): 7.56 err/s: 6.00 reconn/s: 0.00
[ 69s ] thds: 10 tps: 1797.04 qps: 36031.85 (r/w/o: 25232.59/7183.17/3616.08) lat (ms,95%): 8.58 err/s: 6.00 reconn/s: 0.00
[ 70s ] thds: 10 tps: 1955.99 qps: 39184.70 (r/w/o: 27431.79/7827.94/3924.97) lat (ms,95%): 7.56 err/s: 3.00 reconn/s: 0.00
[ 71s ] thds: 10 tps: 1992.01 qps: 39902.16 (r/w/o: 27939.11/7962.03/4001.02) lat (ms,95%): 7.56 err/s: 5.00 reconn/s: 0.00
[ 72s ] thds: 10 tps: 1959.88 qps: 39268.60 (r/w/o: 27491.32/7846.52/3930.76) lat (ms,95%): 7.56 err/s: 2.00 reconn/s: 0.00
[ 73s ] thds: 10 tps: 1909.05 qps: 38219.08 (r/w/o: 26759.76/7629.22/3830.11) lat (ms,95%): 7.98 err/s: 3.00 reconn/s: 0.00
[ 74s ] thds: 10 tps: 1938.08 qps: 38813.59 (r/w/o: 27164.12/7757.32/3892.16) lat (ms,95%): 7.70 err/s: 3.00 reconn/s: 0.00
[ 75s ] thds: 10 tps: 1834.97 qps: 36736.34 (r/w/o: 25725.54/7324.87/3685.93) lat (ms,95%): 8.74 err/s: 4.00 reconn/s: 0.00
[ 76s ] thds: 10 tps: 1942.03 qps: 38936.67 (r/w/o: 27267.47/7772.13/3897.07) lat (ms,95%): 7.56 err/s: 3.00 reconn/s: 0.00
[ 77s ] thds: 10 tps: 2035.93 qps: 40840.60 (r/w/o: 28590.02/8156.72/4093.86) lat (ms,95%): 7.30 err/s: 7.00 reconn/s: 0.00
[ 78s ] thds: 10 tps: 1767.95 qps: 35387.95 (r/w/o: 24773.27/7066.79/3547.90) lat (ms,95%): 10.09 err/s: 2.00 reconn/s: 0.00
[ 79s ] thds: 10 tps: 1813.08 qps: 36335.66 (r/w/o: 25444.16/7252.33/3639.17) lat (ms,95%): 8.43 err/s: 3.00 reconn/s: 0.00
[ 80s ] thds: 10 tps: 1922.93 qps: 38480.65 (r/w/o: 26938.06/7685.73/3856.87) lat (ms,95%): 7.70 err/s: 4.00 reconn/s: 0.00
[ 81s ] thds: 10 tps: 1956.03 qps: 39180.54 (r/w/o: 27428.38/7826.11/3926.05) lat (ms,95%): 8.58 err/s: 3.00 reconn/s: 0.00
[ 82s ] thds: 10 tps: 2020.03 qps: 40572.70 (r/w/o: 28419.49/8083.14/4070.07) lat (ms,95%): 7.30 err/s: 9.00 reconn/s: 0.00
[ 83s ] thds: 10 tps: 1831.57 qps: 36744.22 (r/w/o: 25728.84/7338.26/3677.12) lat (ms,95%): 9.22 err/s: 4.99 reconn/s: 0.00
[ 84s ] thds: 10 tps: 1926.61 qps: 38650.45 (r/w/o: 27065.73/7706.45/3878.27) lat (ms,95%): 7.98 err/s: 8.02 reconn/s: 0.00
[ 85s ] thds: 10 tps: 1775.31 qps: 35544.26 (r/w/o: 24877.38/7100.26/3566.61) lat (ms,95%): 9.91 err/s: 4.00 reconn/s: 0.00
[ 86s ] thds: 10 tps: 1776.10 qps: 35674.95 (r/w/o: 24982.37/7120.39/3572.20) lat (ms,95%): 8.58 err/s: 6.00 reconn/s: 0.00
[ 87s ] thds: 10 tps: 1931.77 qps: 38721.45 (r/w/o: 27114.82/7734.08/3872.55) lat (ms,95%): 7.56 err/s: 3.00 reconn/s: 0.00
[ 88s ] thds: 10 tps: 1940.10 qps: 38873.10 (r/w/o: 27220.47/7759.42/3893.21) lat (ms,95%): 7.70 err/s: 3.00 reconn/s: 0.00
[ 89s ] thds: 10 tps: 2031.62 qps: 40722.36 (r/w/o: 28512.65/8123.48/4086.23) lat (ms,95%): 7.30 err/s: 8.00 reconn/s: 0.00
[ 90s ] thds: 10 tps: 1941.16 qps: 38874.15 (r/w/o: 27213.20/7766.63/3894.32) lat (ms,95%): 7.98 err/s: 4.00 reconn/s: 0.00
[ 91s ] thds: 10 tps: 1859.05 qps: 37307.05 (r/w/o: 26125.73/7445.21/3736.11) lat (ms,95%): 8.90 err/s: 6.00 reconn/s: 0.00
[ 92s ] thds: 10 tps: 1987.05 qps: 39779.99 (r/w/o: 27845.69/7940.20/3994.10) lat (ms,95%): 7.56 err/s: 3.00 reconn/s: 0.00
[ 93s ] thds: 10 tps: 2023.01 qps: 40629.15 (r/w/o: 28465.11/8091.03/4073.02) lat (ms,95%): 7.43 err/s: 7.00 reconn/s: 0.00
[ 94s ] thds: 10 tps: 2040.96 qps: 40867.16 (r/w/o: 28602.41/8171.83/4092.92) lat (ms,95%): 7.30 err/s: 2.00 reconn/s: 0.00
[ 95s ] thds: 10 tps: 1925.95 qps: 38530.00 (r/w/o: 26972.30/7692.80/3864.90) lat (ms,95%): 8.90 err/s: 2.00 reconn/s: 0.00
[ 96s ] thds: 10 tps: 1820.06 qps: 36437.11 (r/w/o: 25510.78/7275.22/3651.11) lat (ms,95%): 9.56 err/s: 4.00 reconn/s: 0.00
[ 97s ] thds: 10 tps: 1636.09 qps: 32851.70 (r/w/o: 23009.18/6547.35/3295.16) lat (ms,95%): 10.84 err/s: 6.00 reconn/s: 0.00
[ 98s ] thds: 10 tps: 1427.23 qps: 28661.53 (r/w/o: 20074.16/5720.91/2866.45) lat (ms,95%): 8.13 err/s: 4.00 reconn/s: 0.00
[ 99s ] thds: 10 tps: 451.07 qps: 9013.46 (r/w/o: 6307.02/1798.29/908.15) lat (ms,95%): 14.21 err/s: 2.00 reconn/s: 0.00
[ 100s ] thds: 10 tps: 1611.50 qps: 32269.01 (r/w/o: 22582.00/6454.00/3233.01) lat (ms,95%): 10.46 err/s: 2.00 reconn/s: 0.00
[ 101s ] thds: 10 tps: 1941.80 qps: 38951.97 (r/w/o: 27265.18/7791.19/3895.60) lat (ms,95%): 7.70 err/s: 2.00 reconn/s: 0.00
[ 102s ] thds: 10 tps: 1875.12 qps: 37499.36 (r/w/o: 26268.65/7468.47/3762.24) lat (ms,95%): 7.98 err/s: 5.00 reconn/s: 0.00
[ 103s ] thds: 10 tps: 1797.32 qps: 35991.40 (r/w/o: 25191.48/7192.28/3607.64) lat (ms,95%): 9.91 err/s: 3.00 reconn/s: 0.00
[ 104s ] thds: 10 tps: 1969.84 qps: 39552.88 (r/w/o: 27699.82/7887.37/3965.69) lat (ms,95%): 7.84 err/s: 7.00 reconn/s: 0.00
[ 105s ] thds: 10 tps: 2029.00 qps: 40686.00 (r/w/o: 28487.00/8122.00/4077.00) lat (ms,95%): 7.30 err/s: 5.00 reconn/s: 0.00
[ 106s ] thds: 10 tps: 1998.87 qps: 40028.33 (r/w/o: 28027.13/7988.47/4012.73) lat (ms,95%): 7.43 err/s: 4.00 reconn/s: 0.00
[ 107s ] thds: 10 tps: 1975.40 qps: 39588.91 (r/w/o: 27716.53/7907.60/3964.78) lat (ms,95%): 7.43 err/s: 2.99 reconn/s: 0.00
[ 108s ] thds: 10 tps: 1699.24 qps: 33953.73 (r/w/o: 23765.31/6779.93/3408.50) lat (ms,95%): 9.73 err/s: 2.00 reconn/s: 0.00
[ 109s ] thds: 10 tps: 1261.79 qps: 25375.63 (r/w/o: 17783.90/5060.15/2531.57) lat (ms,95%): 7.98 err/s: 2.99 reconn/s: 0.00
[ 110s ] thds: 10 tps: 511.60 qps: 10218.91 (r/w/o: 7143.32/2041.38/1034.21) lat (ms,95%): 14.46 err/s: 2.00 reconn/s: 0.00
[ 111s ] thds: 10 tps: 1722.91 qps: 34492.22 (r/w/o: 24152.76/6883.64/3455.83) lat (ms,95%): 9.22 err/s: 2.00 reconn/s: 0.00
[ 112s ] thds: 10 tps: 1924.32 qps: 38584.21 (r/w/o: 27010.35/7706.26/3867.60) lat (ms,95%): 7.56 err/s: 6.99 reconn/s: 0.00
[ 113s ] thds: 10 tps: 1866.64 qps: 37433.91 (r/w/o: 26217.06/7466.54/3750.30) lat (ms,95%): 7.98 err/s: 3.01 reconn/s: 0.00
[ 114s ] thds: 10 tps: 2042.01 qps: 40936.20 (r/w/o: 28666.14/8169.04/4101.02) lat (ms,95%): 7.30 err/s: 5.00 reconn/s: 0.00
[ 115s ] thds: 10 tps: 1933.78 qps: 38656.66 (r/w/o: 27050.96/7722.13/3883.56) lat (ms,95%): 8.90 err/s: 2.00 reconn/s: 0.00
[ 116s ] thds: 10 tps: 2034.19 qps: 40759.72 (r/w/o: 28540.61/8136.74/4082.37) lat (ms,95%): 7.30 err/s: 3.00 reconn/s: 0.00
[ 117s ] thds: 10 tps: 1452.65 qps: 29139.92 (r/w/o: 20400.04/5822.59/2917.29) lat (ms,95%): 16.71 err/s: 3.00 reconn/s: 0.00
[ 118s ] thds: 10 tps: 1808.48 qps: 36315.65 (r/w/o: 25427.76/7246.93/3640.97) lat (ms,95%): 8.58 err/s: 7.00 reconn/s: 0.00
[ 119s ] thds: 10 tps: 1875.01 qps: 37490.27 (r/w/o: 26247.19/7482.05/3761.03) lat (ms,95%): 9.22 err/s: 3.00 reconn/s: 0.00
[ 120s ] thds: 10 tps: 1768.97 qps: 35394.42 (r/w/o: 24776.60/7061.89/3555.94) lat (ms,95%): 8.74 err/s: 2.00 reconn/s: 0.00
[ 121s ] thds: 10 tps: 1769.81 qps: 35515.21 (r/w/o: 24879.35/7089.24/3546.62) lat (ms,95%): 8.43 err/s: 3.00 reconn/s: 0.00
[ 122s ] thds: 10 tps: 1757.15 qps: 35220.02 (r/w/o: 24658.11/7031.60/3530.30) lat (ms,95%): 8.58 err/s: 5.00 reconn/s: 0.00
[ 123s ] thds: 10 tps: 1904.95 qps: 38229.97 (r/w/o: 26767.28/7636.79/3825.90) lat (ms,95%): 7.84 err/s: 6.00 reconn/s: 0.00
[ 124s ] thds: 10 tps: 1855.10 qps: 37154.00 (r/w/o: 26020.40/7410.40/3723.20) lat (ms,95%): 8.13 err/s: 4.00 reconn/s: 0.00
[ 125s ] thds: 10 tps: 1923.96 qps: 38532.13 (r/w/o: 26971.39/7702.83/3857.91) lat (ms,95%): 7.70 err/s: 3.00 reconn/s: 0.00
[ 126s ] thds: 10 tps: 1740.74 qps: 34799.71 (r/w/o: 24356.30/6949.94/3493.47) lat (ms,95%): 10.46 err/s: 1.00 reconn/s: 0.00
[ 127s ] thds: 10 tps: 1842.03 qps: 36905.62 (r/w/o: 25837.43/7371.12/3697.06) lat (ms,95%): 8.43 err/s: 3.00 reconn/s: 0.00
[ 128s ] thds: 10 tps: 1899.31 qps: 38030.27 (r/w/o: 26618.39/7604.25/3807.63) lat (ms,95%): 7.98 err/s: 2.00 reconn/s: 0.00
[ 129s ] thds: 10 tps: 1785.92 qps: 35823.49 (r/w/o: 25084.94/7151.70/3586.85) lat (ms,95%): 9.06 err/s: 4.00 reconn/s: 0.00
[ 130s ] thds: 10 tps: 1819.05 qps: 36494.08 (r/w/o: 25560.75/7274.21/3659.11) lat (ms,95%): 8.74 err/s: 8.00 reconn/s: 0.00
[ 131s ] thds: 10 tps: 1850.91 qps: 37012.17 (r/w/o: 25904.72/7400.63/3706.82) lat (ms,95%): 8.13 err/s: 0.00 reconn/s: 0.00
[ 132s ] thds: 10 tps: 1894.86 qps: 37999.13 (r/w/o: 26605.99/7587.43/3805.71) lat (ms,95%): 7.98 err/s: 6.00 reconn/s: 0.00
[ 133s ] thds: 10 tps: 1861.22 qps: 37272.33 (r/w/o: 26103.03/7434.86/3734.43) lat (ms,95%): 8.13 err/s: 2.00 reconn/s: 0.00
[ 134s ] thds: 10 tps: 1943.99 qps: 38938.90 (r/w/o: 27259.93/7774.98/3903.99) lat (ms,95%): 7.84 err/s: 3.00 reconn/s: 0.00
[ 135s ] thds: 10 tps: 1822.85 qps: 36485.05 (r/w/o: 25542.94/7283.41/3658.70) lat (ms,95%): 8.43 err/s: 1.00 reconn/s: 0.00
[ 136s ] thds: 10 tps: 1917.79 qps: 38393.72 (r/w/o: 26884.00/7660.15/3849.57) lat (ms,95%): 7.84 err/s: 2.00 reconn/s: 0.00
[ 137s ] thds: 10 tps: 1912.22 qps: 38328.36 (r/w/o: 26830.05/7657.87/3840.44) lat (ms,95%): 7.84 err/s: 5.00 reconn/s: 0.00
[ 138s ] thds: 10 tps: 1911.11 qps: 38236.15 (r/w/o: 26762.50/7641.43/3832.22) lat (ms,95%): 7.98 err/s: 4.00 reconn/s: 0.00
[ 139s ] thds: 10 tps: 1838.02 qps: 36868.47 (r/w/o: 25819.33/7358.09/3691.05) lat (ms,95%): 8.13 err/s: 4.00 reconn/s: 0.00
[ 140s ] thds: 10 tps: 1901.05 qps: 38081.03 (r/w/o: 26660.72/7598.20/3822.10) lat (ms,95%): 7.84 err/s: 3.00 reconn/s: 0.00
[ 141s ] thds: 10 tps: 1876.99 qps: 37620.72 (r/w/o: 26341.80/7512.94/3765.97) lat (ms,95%): 8.13 err/s: 3.00 reconn/s: 0.00
[ 142s ] thds: 10 tps: 1851.00 qps: 37063.07 (r/w/o: 25945.05/7404.01/3714.01) lat (ms,95%): 8.13 err/s: 2.00 reconn/s: 0.00
[ 143s ] thds: 10 tps: 1908.99 qps: 38213.72 (r/w/o: 26756.81/7626.94/3829.97) lat (ms,95%): 7.84 err/s: 3.00 reconn/s: 0.00
[ 144s ] thds: 10 tps: 1921.02 qps: 38584.43 (r/w/o: 27009.30/7710.09/3865.04) lat (ms,95%): 7.84 err/s: 8.00 reconn/s: 0.00
[ 145s ] thds: 10 tps: 1840.53 qps: 36836.48 (r/w/o: 25792.33/7347.13/3697.02) lat (ms,95%): 8.28 err/s: 3.99 reconn/s: 0.00
[ 146s ] thds: 10 tps: 1818.41 qps: 36437.42 (r/w/o: 25515.91/7264.64/3656.87) lat (ms,95%): 8.13 err/s: 4.01 reconn/s: 0.00
[ 147s ] thds: 10 tps: 1706.61 qps: 34151.16 (r/w/o: 23903.52/6824.43/3423.21) lat (ms,95%): 10.27 err/s: 1.00 reconn/s: 0.00
[ 148s ] thds: 10 tps: 1845.28 qps: 37011.36 (r/w/o: 25916.74/7390.09/3704.53) lat (ms,95%): 8.28 err/s: 3.00 reconn/s: 0.00
[ 149s ] thds: 10 tps: 1848.12 qps: 37023.53 (r/w/o: 25925.79/7386.48/3711.27) lat (ms,95%): 8.13 err/s: 4.01 reconn/s: 0.00
[ 150s ] thds: 10 tps: 1775.07 qps: 35544.39 (r/w/o: 24882.97/7092.28/3569.14) lat (ms,95%): 8.13 err/s: 5.00 reconn/s: 0.00
[ 151s ] thds: 10 tps: 1693.95 qps: 33983.09 (r/w/o: 23802.36/6776.82/3403.91) lat (ms,95%): 9.22 err/s: 3.00 reconn/s: 0.00
[ 152s ] thds: 10 tps: 1799.01 qps: 36017.13 (r/w/o: 25208.09/7194.03/3615.01) lat (ms,95%): 8.28 err/s: 4.00 reconn/s: 0.00
[ 153s ] thds: 10 tps: 1674.88 qps: 33553.65 (r/w/o: 23489.35/6700.53/3363.76) lat (ms,95%): 10.65 err/s: 3.00 reconn/s: 0.00
[ 154s ] thds: 10 tps: 1763.15 qps: 35345.98 (r/w/o: 24744.09/7063.60/3538.30) lat (ms,95%): 9.39 err/s: 4.00 reconn/s: 0.00
[ 155s ] thds: 10 tps: 1884.85 qps: 37770.00 (r/w/o: 26446.90/7539.40/3783.70) lat (ms,95%): 7.98 err/s: 4.00 reconn/s: 0.00
[ 156s ] thds: 10 tps: 1803.36 qps: 36069.25 (r/w/o: 25251.07/7204.45/3613.72) lat (ms,95%): 8.43 err/s: 2.00 reconn/s: 0.00
[ 157s ] thds: 10 tps: 1940.81 qps: 38910.22 (r/w/o: 27251.36/7758.23/3900.63) lat (ms,95%): 7.70 err/s: 4.00 reconn/s: 0.00
[ 158s ] thds: 10 tps: 1922.02 qps: 38593.33 (r/w/o: 27017.23/7710.07/3866.03) lat (ms,95%): 7.70 err/s: 7.00 reconn/s: 0.00
[ 159s ] thds: 10 tps: 1794.99 qps: 35903.82 (r/w/o: 25139.87/7161.96/3601.98) lat (ms,95%): 8.43 err/s: 1.00 reconn/s: 0.00
[ 160s ] thds: 10 tps: 1856.85 qps: 37247.91 (r/w/o: 26080.84/7437.38/3729.69) lat (ms,95%): 7.98 err/s: 5.00 reconn/s: 0.00
[ 161s ] thds: 10 tps: 1747.96 qps: 34979.15 (r/w/o: 24492.40/6975.83/3510.91) lat (ms,95%): 9.56 err/s: 2.00 reconn/s: 0.00
[ 162s ] thds: 10 tps: 1857.23 qps: 37154.54 (r/w/o: 26002.18/7425.91/3726.46) lat (ms,95%): 8.13 err/s: 2.00 reconn/s: 0.00
[ 163s ] thds: 10 tps: 1729.01 qps: 34661.16 (r/w/o: 24264.11/6924.03/3473.02) lat (ms,95%): 8.58 err/s: 4.00 reconn/s: 0.00
[ 164s ] thds: 10 tps: 1903.39 qps: 38178.75 (r/w/o: 26740.42/7616.56/3821.77) lat (ms,95%): 7.84 err/s: 4.00 reconn/s: 0.00
[ 165s ] thds: 10 tps: 1919.51 qps: 38434.18 (r/w/o: 26901.13/7675.03/3858.02) lat (ms,95%): 7.84 err/s: 5.00 reconn/s: 0.00
[ 166s ] thds: 10 tps: 1919.92 qps: 38467.45 (r/w/o: 26943.91/7670.69/3852.84) lat (ms,95%): 7.84 err/s: 2.00 reconn/s: 0.00
[ 167s ] thds: 10 tps: 1883.11 qps: 37711.23 (r/w/o: 26398.56/7535.45/3777.22) lat (ms,95%): 7.98 err/s: 2.00 reconn/s: 0.00
[ 168s ] thds: 10 tps: 1904.93 qps: 38142.53 (r/w/o: 26707.97/7615.71/3818.85) lat (ms,95%): 7.84 err/s: 3.00 reconn/s: 0.00
[ 169s ] thds: 10 tps: 1898.10 qps: 37988.98 (r/w/o: 26584.39/7597.40/3807.20) lat (ms,95%): 7.98 err/s: 3.00 reconn/s: 0.00
[ 170s ] thds: 10 tps: 1930.00 qps: 38674.03 (r/w/o: 27078.02/7722.01/3874.00) lat (ms,95%): 7.84 err/s: 4.00 reconn/s: 0.00
[ 171s ] thds: 10 tps: 1905.99 qps: 38185.71 (r/w/o: 26745.79/7614.94/3824.97) lat (ms,95%): 7.98 err/s: 3.00 reconn/s: 0.00
[ 172s ] thds: 10 tps: 1888.73 qps: 37898.58 (r/w/o: 26530.21/7574.92/3793.46) lat (ms,95%): 7.70 err/s: 6.00 reconn/s: 0.00
[ 173s ] thds: 10 tps: 1794.26 qps: 35885.25 (r/w/o: 25112.67/7170.05/3602.53) lat (ms,95%): 9.56 err/s: 3.00 reconn/s: 0.00
[ 174s ] thds: 10 tps: 1751.03 qps: 35090.57 (r/w/o: 24581.40/6998.11/3511.06) lat (ms,95%): 8.74 err/s: 2.00 reconn/s: 0.00
[ 175s ] thds: 10 tps: 1907.86 qps: 38212.14 (r/w/o: 26744.00/7639.43/3828.71) lat (ms,95%): 7.84 err/s: 4.00 reconn/s: 0.00
[ 176s ] thds: 10 tps: 1891.09 qps: 37904.89 (r/w/o: 26543.32/7561.38/3800.19) lat (ms,95%): 7.98 err/s: 5.00 reconn/s: 0.00
[ 177s ] thds: 10 tps: 1823.71 qps: 36612.19 (r/w/o: 25639.93/7306.84/3665.42) lat (ms,95%): 8.43 err/s: 6.00 reconn/s: 0.00
[ 178s ] thds: 10 tps: 1915.34 qps: 38377.91 (r/w/o: 26866.84/7667.38/3843.69) lat (ms,95%): 7.84 err/s: 3.00 reconn/s: 0.00
[ 179s ] thds: 10 tps: 1908.96 qps: 38255.14 (r/w/o: 26788.40/7629.83/3836.91) lat (ms,95%): 7.98 err/s: 5.00 reconn/s: 0.00
[ 180s ] thds: 10 tps: 1778.25 qps: 35630.81 (r/w/o: 24942.36/7122.97/3565.47) lat (ms,95%): 8.74 err/s: 1.99 reconn/s: 0.00
[ 181s ] thds: 10 tps: 1808.56 qps: 36196.18 (r/w/o: 25339.83/7223.19/3633.16) lat (ms,95%): 8.28 err/s: 5.02 reconn/s: 0.00
[ 182s ] thds: 10 tps: 1802.25 qps: 36094.93 (r/w/o: 25267.45/7213.98/3613.49) lat (ms,95%): 8.28 err/s: 1.00 reconn/s: 0.00
[ 183s ] thds: 10 tps: 1822.03 qps: 36483.55 (r/w/o: 25547.39/7283.11/3653.06) lat (ms,95%): 8.13 err/s: 2.00 reconn/s: 0.00
[ 184s ] thds: 10 tps: 1711.71 qps: 34195.16 (r/w/o: 23926.91/6836.83/3431.41) lat (ms,95%): 8.90 err/s: 0.00 reconn/s: 0.00
[ 185s ] thds: 10 tps: 1741.18 qps: 34916.56 (r/w/o: 24456.50/6966.71/3493.36) lat (ms,95%): 8.74 err/s: 4.00 reconn/s: 0.00
[ 186s ] thds: 10 tps: 1812.17 qps: 36276.38 (r/w/o: 25392.36/7244.67/3639.34) lat (ms,95%): 8.43 err/s: 3.00 reconn/s: 0.00
[ 187s ] thds: 10 tps: 1732.01 qps: 34723.29 (r/w/o: 24312.20/6933.06/3478.03) lat (ms,95%): 8.58 err/s: 4.00 reconn/s: 0.00
[ 188s ] thds: 10 tps: 1792.04 qps: 35885.74 (r/w/o: 25129.52/7159.15/3597.07) lat (ms,95%): 8.90 err/s: 3.00 reconn/s: 0.00
[ 189s ] thds: 10 tps: 1803.93 qps: 36283.53 (r/w/o: 25413.97/7237.71/3631.85) lat (ms,95%): 9.22 err/s: 8.00 reconn/s: 0.00
[ 190s ] thds: 10 tps: 1934.71 qps: 38709.10 (r/w/o: 27095.87/7734.82/3878.41) lat (ms,95%): 7.84 err/s: 3.00 reconn/s: 0.00
[ 191s ] thds: 10 tps: 1805.20 qps: 36236.95 (r/w/o: 25367.76/7235.79/3633.40) lat (ms,95%): 8.90 err/s: 8.00 reconn/s: 0.00
[ 192s ] thds: 10 tps: 1895.12 qps: 37963.42 (r/w/o: 26583.70/7575.48/3804.24) lat (ms,95%): 8.13 err/s: 2.00 reconn/s: 0.00
[ 193s ] thds: 10 tps: 1900.87 qps: 38111.32 (r/w/o: 26691.13/7598.47/3821.73) lat (ms,95%): 7.84 err/s: 6.00 reconn/s: 0.00
[ 194s ] thds: 10 tps: 1920.15 qps: 38582.93 (r/w/o: 27021.05/7697.58/3864.29) lat (ms,95%): 7.70 err/s: 9.00 reconn/s: 0.00
[ 195s ] thds: 10 tps: 1722.57 qps: 34461.38 (r/w/o: 24125.96/6875.28/3460.13) lat (ms,95%): 8.74 err/s: 2.00 reconn/s: 0.00
[ 196s ] thds: 10 tps: 1784.45 qps: 35753.96 (r/w/o: 25019.27/7150.79/3583.90) lat (ms,95%): 7.98 err/s: 5.00 reconn/s: 0.00
[ 197s ] thds: 10 tps: 1656.21 qps: 33200.22 (r/w/o: 23255.93/6620.86/3323.42) lat (ms,95%): 11.04 err/s: 2.00 reconn/s: 0.00
[ 198s ] thds: 10 tps: 1696.62 qps: 33942.48 (r/w/o: 23757.73/6782.49/3402.26) lat (ms,95%): 9.39 err/s: 3.00 reconn/s: 0.00
[ 199s ] thds: 10 tps: 1916.13 qps: 38540.59 (r/w/o: 26994.82/7679.52/3866.26) lat (ms,95%): 7.98 err/s: 10.00 reconn/s: 0.00
[ 200s ] thds: 10 tps: 1834.07 qps: 36691.37 (r/w/o: 25691.96/7321.27/3678.14) lat (ms,95%): 8.28 err/s: 1.00 reconn/s: 0.00
[ 201s ] thds: 10 tps: 1803.93 qps: 36170.51 (r/w/o: 25322.96/7221.70/3625.85) lat (ms,95%): 8.58 err/s: 4.00 reconn/s: 0.00
[ 202s ] thds: 10 tps: 1797.99 qps: 36072.82 (r/w/o: 25245.87/7217.96/3608.98) lat (ms,95%): 7.98 err/s: 3.00 reconn/s: 0.00
[ 203s ] thds: 10 tps: 1421.11 qps: 28372.14 (r/w/o: 19866.50/5657.43/2848.21) lat (ms,95%): 11.45 err/s: 2.00 reconn/s: 0.00
[ 204s ] thds: 10 tps: 1734.44 qps: 34808.71 (r/w/o: 24381.09/6938.76/3488.86) lat (ms,95%): 10.09 err/s: 5.99 reconn/s: 0.00
[ 205s ] thds: 10 tps: 1870.67 qps: 37436.41 (r/w/o: 26201.38/7473.67/3761.36) lat (ms,95%): 8.43 err/s: 3.00 reconn/s: 0.00
[ 206s ] thds: 10 tps: 1671.99 qps: 33488.72 (r/w/o: 23445.80/6690.94/3351.97) lat (ms,95%): 9.56 err/s: 1.00 reconn/s: 0.00
[ 207s ] thds: 10 tps: 1698.01 qps: 33998.20 (r/w/o: 23805.14/6785.04/3408.02) lat (ms,95%): 8.90 err/s: 2.00 reconn/s: 0.00
[ 208s ] thds: 10 tps: 1834.88 qps: 36726.50 (r/w/o: 25707.25/7340.50/3678.75) lat (ms,95%): 8.13 err/s: 1.00 reconn/s: 0.00
[ 209s ] thds: 10 tps: 1776.11 qps: 35608.17 (r/w/o: 24933.52/7103.43/3571.22) lat (ms,95%): 8.74 err/s: 7.00 reconn/s: 0.00
[ 210s ] thds: 10 tps: 1787.64 qps: 35941.74 (r/w/o: 25173.92/7168.55/3599.27) lat (ms,95%): 8.13 err/s: 8.00 reconn/s: 0.00
[ 211s ] thds: 10 tps: 1787.04 qps: 35745.77 (r/w/o: 25024.54/7136.15/3585.08) lat (ms,95%): 8.28 err/s: 2.00 reconn/s: 0.00
[ 212s ] thds: 10 tps: 1898.29 qps: 38072.79 (r/w/o: 26657.05/7603.16/3812.58) lat (ms,95%): 7.98 err/s: 5.00 reconn/s: 0.00
[ 213s ] thds: 10 tps: 1559.02 qps: 31229.45 (r/w/o: 21869.31/6232.09/3128.04) lat (ms,95%): 8.90 err/s: 3.00 reconn/s: 0.00
[ 214s ] thds: 10 tps: 1833.73 qps: 36772.67 (r/w/o: 25750.27/7342.94/3679.47) lat (ms,95%): 8.28 err/s: 4.00 reconn/s: 0.00
[ 215s ] thds: 10 tps: 1852.30 qps: 37104.93 (r/w/o: 25981.15/7403.18/3720.59) lat (ms,95%): 7.84 err/s: 4.00 reconn/s: 0.00
[ 216s ] thds: 10 tps: 1834.99 qps: 36769.84 (r/w/o: 25737.89/7347.97/3683.98) lat (ms,95%): 7.98 err/s: 4.00 reconn/s: 0.00
[ 217s ] thds: 10 tps: 1825.99 qps: 36539.82 (r/w/o: 25579.87/7298.96/3660.98) lat (ms,95%): 8.13 err/s: 0.00 reconn/s: 0.00
[ 218s ] thds: 10 tps: 1637.95 qps: 32806.03 (r/w/o: 22969.32/6544.81/3291.90) lat (ms,95%): 9.39 err/s: 4.00 reconn/s: 0.00
[ 219s ] thds: 10 tps: 1808.82 qps: 36260.41 (r/w/o: 25384.49/7242.28/3633.64) lat (ms,95%): 8.28 err/s: 6.00 reconn/s: 0.00
[ 220s ] thds: 10 tps: 1863.06 qps: 37296.17 (r/w/o: 26108.82/7446.23/3741.12) lat (ms,95%): 7.98 err/s: 2.00 reconn/s: 0.00
[ 221s ] thds: 10 tps: 1894.18 qps: 37980.70 (r/w/o: 26602.59/7574.74/3803.37) lat (ms,95%): 7.84 err/s: 4.00 reconn/s: 0.00
[ 222s ] thds: 10 tps: 1536.87 qps: 30846.47 (r/w/o: 21579.23/6180.49/3086.75) lat (ms,95%): 9.06 err/s: 2.00 reconn/s: 0.00
[ 223s ] thds: 10 tps: 1804.52 qps: 36048.47 (r/w/o: 25249.32/7180.10/3619.04) lat (ms,95%): 7.84 err/s: 1.00 reconn/s: 0.00
[ 224s ] thds: 10 tps: 1870.44 qps: 37406.73 (r/w/o: 26180.11/7465.74/3760.88) lat (ms,95%): 8.13 err/s: 3.00 reconn/s: 0.00
[ 225s ] thds: 10 tps: 1937.20 qps: 38892.11 (r/w/o: 27236.87/7763.82/3891.41) lat (ms,95%): 7.84 err/s: 5.00 reconn/s: 0.00
[ 226s ] thds: 10 tps: 1899.00 qps: 38048.92 (r/w/o: 26642.95/7592.98/3812.99) lat (ms,95%): 7.70 err/s: 4.00 reconn/s: 0.00
[ 227s ] thds: 10 tps: 1860.91 qps: 37264.15 (r/w/o: 26094.70/7437.63/3731.81) lat (ms,95%): 7.98 err/s: 3.00 reconn/s: 0.00
[ 228s ] thds: 10 tps: 1858.12 qps: 37295.34 (r/w/o: 26102.64/7456.47/3736.23) lat (ms,95%): 8.43 err/s: 7.00 reconn/s: 0.00
[ 229s ] thds: 10 tps: 1627.00 qps: 32605.91 (r/w/o: 22840.94/6492.98/3271.99) lat (ms,95%): 11.04 err/s: 3.00 reconn/s: 0.00
[ 230s ] thds: 10 tps: 1757.96 qps: 35165.18 (r/w/o: 24605.43/7031.84/3527.92) lat (ms,95%): 8.74 err/s: 4.00 reconn/s: 0.00
[ 231s ] thds: 10 tps: 1822.88 qps: 36533.51 (r/w/o: 25583.26/7290.50/3659.75) lat (ms,95%): 8.28 err/s: 3.00 reconn/s: 0.00
[ 232s ] thds: 10 tps: 1500.07 qps: 30083.34 (r/w/o: 21062.94/6003.27/3017.13) lat (ms,95%): 8.58 err/s: 4.00 reconn/s: 0.00
[ 233s ] thds: 10 tps: 1737.00 qps: 34792.10 (r/w/o: 24358.07/6950.02/3484.01) lat (ms,95%): 10.46 err/s: 1.00 reconn/s: 0.00
[ 234s ] thds: 10 tps: 1718.07 qps: 34363.41 (r/w/o: 24051.99/6869.28/3442.14) lat (ms,95%): 8.74 err/s: 2.00 reconn/s: 0.00
[ 235s ] thds: 10 tps: 1892.98 qps: 37992.59 (r/w/o: 26609.71/7568.92/3813.96) lat (ms,95%): 7.98 err/s: 8.00 reconn/s: 0.00
[ 236s ] thds: 10 tps: 1854.92 qps: 37138.36 (r/w/o: 26004.85/7416.67/3716.84) lat (ms,95%): 7.98 err/s: 2.00 reconn/s: 0.00
[ 237s ] thds: 10 tps: 1760.11 qps: 35352.20 (r/w/o: 24756.54/7056.44/3539.22) lat (ms,95%): 9.91 err/s: 7.00 reconn/s: 0.00
[ 238s ] thds: 10 tps: 1869.22 qps: 37420.35 (r/w/o: 26201.04/7473.88/3745.43) lat (ms,95%): 8.13 err/s: 2.00 reconn/s: 0.00
[ 239s ] thds: 10 tps: 1864.74 qps: 37280.74 (r/w/o: 26085.32/7456.95/3738.48) lat (ms,95%): 7.98 err/s: 1.00 reconn/s: 0.00
[ 240s ] thds: 10 tps: 1635.28 qps: 32823.63 (r/w/o: 22984.93/6554.13/3284.56) lat (ms,95%): 10.27 err/s: 3.00 reconn/s: 0.00
[ 241s ] thds: 10 tps: 1461.62 qps: 29234.40 (r/w/o: 20472.69/5827.47/2934.24) lat (ms,95%): 9.56 err/s: 2.00 reconn/s: 0.00
[ 242s ] thds: 10 tps: 1674.93 qps: 33556.65 (r/w/o: 23496.06/6694.73/3365.86) lat (ms,95%): 10.46 err/s: 3.00 reconn/s: 0.00
[ 243s ] thds: 10 tps: 1719.09 qps: 34405.71 (r/w/o: 24084.20/6872.34/3449.17) lat (ms,95%): 9.39 err/s: 2.00 reconn/s: 0.00
[ 244s ] thds: 10 tps: 1835.97 qps: 36732.35 (r/w/o: 25711.54/7335.87/3684.93) lat (ms,95%): 8.28 err/s: 2.00 reconn/s: 0.00
[ 245s ] thds: 10 tps: 1885.03 qps: 37740.53 (r/w/o: 26421.37/7532.11/3787.05) lat (ms,95%): 8.13 err/s: 2.00 reconn/s: 0.00
[ 246s ] thds: 10 tps: 1820.07 qps: 36490.34 (r/w/o: 25554.94/7279.27/3656.13) lat (ms,95%): 8.58 err/s: 3.00 reconn/s: 0.00
[ 247s ] thds: 10 tps: 1853.71 qps: 37101.28 (r/w/o: 25966.00/7415.86/3719.43) lat (ms,95%): 8.28 err/s: 2.00 reconn/s: 0.00
[ 248s ] thds: 10 tps: 1892.30 qps: 37926.05 (r/w/o: 26550.24/7572.21/3803.61) lat (ms,95%): 8.13 err/s: 3.00 reconn/s: 0.00
[ 249s ] thds: 10 tps: 1691.00 qps: 33869.93 (r/w/o: 23720.95/6754.99/3393.99) lat (ms,95%): 10.46 err/s: 4.00 reconn/s: 0.00
[ 250s ] thds: 10 tps: 1844.80 qps: 36991.89 (r/w/o: 25905.12/7381.18/3705.59) lat (ms,95%): 8.13 err/s: 5.00 reconn/s: 0.00
[ 251s ] thds: 10 tps: 1135.23 qps: 22763.55 (r/w/o: 15917.19/4568.90/2277.45) lat (ms,95%): 22.69 err/s: 2.00 reconn/s: 0.00
[ 252s ] thds: 10 tps: 1116.33 qps: 22296.62 (r/w/o: 15622.64/4436.32/2237.66) lat (ms,95%): 16.71 err/s: 0.00 reconn/s: 0.00
[ 253s ] thds: 10 tps: 1930.91 qps: 38685.33 (r/w/o: 27086.83/7721.66/3876.84) lat (ms,95%): 7.84 err/s: 5.00 reconn/s: 0.00
[ 254s ] thds: 10 tps: 1960.04 qps: 39291.85 (r/w/o: 27508.60/7847.17/3936.09) lat (ms,95%): 7.70 err/s: 4.00 reconn/s: 0.00
[ 255s ] thds: 10 tps: 1694.25 qps: 33918.03 (r/w/o: 23745.52/6769.01/3403.50) lat (ms,95%): 8.74 err/s: 2.00 reconn/s: 0.00
[ 256s ] thds: 10 tps: 1793.78 qps: 35920.59 (r/w/o: 25147.92/7168.11/3604.56) lat (ms,95%): 8.43 err/s: 4.00 reconn/s: 0.00
[ 257s ] thds: 10 tps: 1657.99 qps: 33251.87 (r/w/o: 23274.91/6646.97/3329.99) lat (ms,95%): 9.73 err/s: 5.00 reconn/s: 0.00
[ 258s ] thds: 10 tps: 1882.85 qps: 37737.07 (r/w/o: 26428.95/7529.42/3778.71) lat (ms,95%): 7.70 err/s: 2.00 reconn/s: 0.00
[ 259s ] thds: 10 tps: 1901.15 qps: 38039.06 (r/w/o: 26629.14/7598.61/3811.31) lat (ms,95%): 7.43 err/s: 2.00 reconn/s: 0.00
[ 260s ] thds: 10 tps: 1792.95 qps: 35984.95 (r/w/o: 25197.27/7179.79/3607.89) lat (ms,95%): 7.84 err/s: 7.00 reconn/s: 0.00
[ 261s ] thds: 10 tps: 1761.90 qps: 35384.91 (r/w/o: 24766.54/7076.58/3541.79) lat (ms,95%): 7.30 err/s: 4.00 reconn/s: 0.00
[ 262s ] thds: 10 tps: 989.66 qps: 19725.20 (r/w/o: 13820.24/3919.65/1985.32) lat (ms,95%): 16.71 err/s: 1.00 reconn/s: 0.00
[ 263s ] thds: 10 tps: 1572.53 qps: 31551.63 (r/w/o: 22097.44/6297.12/3157.06) lat (ms,95%): 8.90 err/s: 4.00 reconn/s: 0.00
[ 264s ] thds: 10 tps: 357.35 qps: 7165.01 (r/w/o: 5011.92/1435.40/717.70) lat (ms,95%): 12.75 err/s: 2.00 reconn/s: 0.00
[ 265s ] thds: 10 tps: 1257.39 qps: 25168.84 (r/w/o: 17621.49/5025.55/2521.79) lat (ms,95%): 13.70 err/s: 2.00 reconn/s: 0.00
[ 266s ] thds: 10 tps: 1821.03 qps: 36498.56 (r/w/o: 25550.39/7294.11/3654.06) lat (ms,95%): 8.43 err/s: 3.00 reconn/s: 0.00
[ 267s ] thds: 10 tps: 1787.00 qps: 35748.02 (r/w/o: 25031.01/7133.00/3584.00) lat (ms,95%): 8.90 err/s: 1.00 reconn/s: 0.00
[ 268s ] thds: 10 tps: 1898.97 qps: 38082.39 (r/w/o: 26664.57/7606.88/3810.94) lat (ms,95%): 8.13 err/s: 4.00 reconn/s: 0.00
[ 269s ] thds: 10 tps: 1832.02 qps: 36684.38 (r/w/o: 25673.26/7327.08/3684.04) lat (ms,95%): 8.43 err/s: 3.00 reconn/s: 0.00
[ 270s ] thds: 10 tps: 1798.94 qps: 36064.78 (r/w/o: 25255.15/7193.76/3615.88) lat (ms,95%): 8.43 err/s: 6.00 reconn/s: 0.00
[ 271s ] thds: 10 tps: 1816.03 qps: 36474.68 (r/w/o: 25543.47/7278.13/3653.07) lat (ms,95%): 8.28 err/s: 9.00 reconn/s: 0.00
[ 272s ] thds: 10 tps: 1829.00 qps: 36626.02 (r/w/o: 25643.01/7309.00/3674.00) lat (ms,95%): 8.28 err/s: 2.00 reconn/s: 0.00
[ 273s ] thds: 10 tps: 1526.01 qps: 30579.14 (r/w/o: 21413.10/6105.03/3061.01) lat (ms,95%): 11.04 err/s: 2.00 reconn/s: 0.00
[ 274s ] thds: 10 tps: 1768.90 qps: 35344.03 (r/w/o: 24735.62/7060.61/3547.80) lat (ms,95%): 8.90 err/s: 1.00 reconn/s: 0.00
[ 275s ] thds: 10 tps: 1802.78 qps: 36168.64 (r/w/o: 25331.94/7219.13/3617.56) lat (ms,95%): 8.28 err/s: 4.00 reconn/s: 0.00
[ 276s ] thds: 10 tps: 1629.32 qps: 32668.36 (r/w/o: 22868.45/6520.27/3279.64) lat (ms,95%): 10.84 err/s: 7.00 reconn/s: 0.00
[ 277s ] thds: 10 tps: 1908.53 qps: 38249.54 (r/w/o: 26789.37/7630.11/3830.05) lat (ms,95%): 7.98 err/s: 2.00 reconn/s: 0.00
[ 278s ] thds: 10 tps: 1844.06 qps: 36917.12 (r/w/o: 25836.78/7380.22/3700.11) lat (ms,95%): 8.28 err/s: 3.00 reconn/s: 0.00
[ 279s ] thds: 10 tps: 1880.20 qps: 37683.09 (r/w/o: 26394.86/7513.81/3774.41) lat (ms,95%): 7.98 err/s: 4.00 reconn/s: 0.00
[ 280s ] thds: 10 tps: 1741.93 qps: 34950.55 (r/w/o: 24461.99/6986.71/3501.85) lat (ms,95%): 8.74 err/s: 4.00 reconn/s: 0.00
[ 281s ] thds: 10 tps: 1887.07 qps: 37740.47 (r/w/o: 26423.03/7525.29/3792.15) lat (ms,95%): 8.13 err/s: 4.00 reconn/s: 0.00
[ 282s ] thds: 10 tps: 1917.07 qps: 38420.36 (r/w/o: 26905.95/7669.27/3845.14) lat (ms,95%): 7.98 err/s: 3.00 reconn/s: 0.00
[ 283s ] thds: 10 tps: 1481.08 qps: 29658.57 (r/w/o: 20764.10/5923.31/2971.16) lat (ms,95%): 8.28 err/s: 2.00 reconn/s: 0.00
[ 284s ] thds: 10 tps: 1877.00 qps: 37569.92 (r/w/o: 26289.94/7513.98/3765.99) lat (ms,95%): 7.98 err/s: 3.00 reconn/s: 0.00
[ 285s ] thds: 10 tps: 1465.99 qps: 29353.88 (r/w/o: 20551.91/5861.98/2939.99) lat (ms,95%): 11.24 err/s: 2.00 reconn/s: 0.00
[ 286s ] thds: 10 tps: 1793.99 qps: 35994.83 (r/w/o: 25210.88/7180.97/3602.98) lat (ms,95%): 8.58 err/s: 5.00 reconn/s: 0.00
[ 287s ] thds: 10 tps: 1880.05 qps: 37773.05 (r/w/o: 26436.73/7551.21/3785.11) lat (ms,95%): 8.13 err/s: 5.00 reconn/s: 0.00
[ 288s ] thds: 10 tps: 1709.01 qps: 34168.13 (r/w/o: 23932.09/6808.03/3428.01) lat (ms,95%): 9.91 err/s: 2.00 reconn/s: 0.00
[ 289s ] thds: 10 tps: 1676.80 qps: 33594.06 (r/w/o: 23526.24/6701.22/3366.61) lat (ms,95%): 11.65 err/s: 3.00 reconn/s: 0.00
[ 290s ] thds: 10 tps: 1902.20 qps: 38122.91 (r/w/o: 26686.74/7607.78/3828.39) lat (ms,95%): 8.28 err/s: 7.00 reconn/s: 0.00
[ 291s ] thds: 10 tps: 1849.95 qps: 37106.00 (r/w/o: 25975.30/7411.80/3718.90) lat (ms,95%): 7.70 err/s: 5.00 reconn/s: 0.00
[ 292s ] thds: 10 tps: 1909.89 qps: 38234.80 (r/w/o: 26779.46/7626.56/3828.78) lat (ms,95%): 7.56 err/s: 2.00 reconn/s: 0.00
[ 293s ] thds: 10 tps: 742.48 qps: 14837.52 (r/w/o: 10369.68/2975.90/1491.95) lat (ms,95%): 29.19 err/s: 1.00 reconn/s: 0.00
[ 294s ] thds: 10 tps: 1578.75 qps: 31639.01 (r/w/o: 22163.51/6302.99/3172.50) lat (ms,95%): 9.73 err/s: 4.00 reconn/s: 0.00
[ 295s ] thds: 10 tps: 1851.60 qps: 37076.95 (r/w/o: 25958.37/7407.39/3711.20) lat (ms,95%): 7.70 err/s: 1.00 reconn/s: 0.00
[ 296s ] thds: 10 tps: 1634.23 qps: 32807.56 (r/w/o: 22975.18/6540.93/3291.44) lat (ms,95%): 9.73 err/s: 6.99 reconn/s: 0.00
[ 297s ] thds: 10 tps: 1591.32 qps: 31875.49 (r/w/o: 22302.53/6382.30/3190.65) lat (ms,95%): 9.06 err/s: 4.00 reconn/s: 0.00
[ 298s ] thds: 10 tps: 1624.72 qps: 32667.43 (r/w/o: 22893.10/6498.89/3275.44) lat (ms,95%): 12.52 err/s: 7.00 reconn/s: 0.00
[ 299s ] thds: 10 tps: 1810.77 qps: 36231.37 (r/w/o: 25364.76/7234.07/3632.54) lat (ms,95%): 7.70 err/s: 2.00 reconn/s: 0.00
[ 300s ] thds: 10 tps: 1778.88 qps: 35665.66 (r/w/o: 24975.36/7115.53/3574.77) lat (ms,95%): 7.70 err/s: 5.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            7602210
        write:                           2167627
        other:                           1088218
        total:                           10858055
    transactions:                        541895 (1806.20 per sec.)
    queries:                             10858055 (36191.24 per sec.)
    ignored errors:                      1120   (3.73 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          300.0167s
    total number of events:              541895

Latency (ms):
         min:                                    3.41
         avg:                                    5.53
         max:                                 1016.67
         95th percentile:                        8.43
         sum:                              2999004.17

Threads fairness:
    events (avg/stddev):           54189.5000/362.04
    execution time (avg/stddev):   299.9004/0.01